In [1]:
import pandas as pd

In [11]:
df=pd.read_csv('chipotle.tsv', sep='\t')
df.to_csv('chipotle.csv', index=False, sep=',')

In [33]:
df.isnull().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1228
item_price               0
dtype: int64

In [34]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,Clementine,$3.39
2,1,1,Nantucket Nectar,Apple,$3.39
3,1,1,Chips and TomatilloGreen Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,TomatilloRed Chili Salsa Hot Black Beans Rice ...,$16.98

In [35]:
df.shape

(4563, 5)

In [36]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [37]:
duplicates = df.duplicated()
df =df[~duplicates]

In [38]:
df['quantity'].value_counts()

1     4296
2      224
3       28
4       10
5        1
15       1
7        1
8        1
10       1
Name: quantity, dtype: int64

In [39]:
df['item_price'].value_counts()

$8.75      719
$11.25     516
$9.25      395
$4.45      344
$8.49      308
          ...
$13.35       1
$7.50        1
$4.36        1
$32.94       1
$11.49       1
Name: item_price, Length: 78, dtype: int64

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4563 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4563 non-null   int64
 1   quantity            4563 non-null   int64
 2   item_name           4563 non-null   object
 3   choice_description  3335 non-null   object
 4   item_price          4563 non-null   object
dtypes: int64(2), object(3)
memory usage: 213.9+ KB

In [27]:
df['choice_description'].value_counts()

[Diet Coke]                                                                                                                                      134
[Coke]                                                                                                                                           123
[Sprite]                                                                                                                                          77
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Lettuce]]                                                                            42
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Guacamole, Lettuce]]                                                                 40
                                                                                                                                                ...
[Fresh Tomato Salsa (Mild), [Pinto Beans, Black Beans, Rice, Cheese, Sour Cream, Lettuce]]                                                         1
[[Fresh Tomato Salsa (Mild), Roasted Chili Corn Salsa (Medium), Tomatillo-Red Chili Salsa (Hot)], [Pinto Beans, Cheese, Sour Cream, Lettuce]]      1
[Fresh Tomato (Mild), [Guacamole, Rice, Black Beans]]                                                                                              1
[[Tomatillo-Green Chili Salsa (Medium), Tomatillo-Red Chili Salsa (Hot)], [Black Beans, Rice, Cheese, Lettuce]]                                    1
[Tomatillo Green Chili Salsa, [Rice, Fajita Vegetables, Black Beans, Guacamole]]                                                                   1
Name: choice_description, Length: 1043, dtype: int64

In [41]:
df['item_name'] = df['item_name'].str.replace('[^a-zA-Z0-9\s]', '')  # Remove special characters
df['choice_description'] = df['choice_description'].str.replace('[^a-zA-Z0-9\s]', '')  # Remove special characters

C:\Users\Asus\AppData\Local\Temp\ipykernel_11256\1610638717.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['item_name'] = df['item_name'].str.replace('[^a-zA-Z0-9\s]', '')  # Remove special characters
C:\Users\Asus\AppData\Local\Temp\ipykernel_11256\1610638717.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  df['choice_description'] = df['choice_description'].str.replace('[^a-zA-Z0-9\s]', '')  # Remove special characters

In [42]:
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,Clementine,$3.39
2,1,1,Nantucket Nectar,Apple,$3.39
3,1,1,Chips and TomatilloGreen Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,TomatilloRed Chili Salsa Hot Black Beans Rice ...,$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,Fresh Tomato Salsa Rice Black Beans Sour Cream...,$11.75
4618,1833,1,Steak Burrito,Fresh Tomato Salsa Rice Sour Cream Cheese Lett...,$11.75
4619,1834,1,Chicken Salad Bowl,Fresh Tomato Salsa Fajita Vegetables Pinto Bea...,$11.25
4620,1834,1,Chicken Salad Bowl,Fresh Tomato Salsa Fajita Vegetables Lettuce,$8.75
4621,1834,1,Chicken Salad Bowl,Fresh Tomato Salsa Fajita Vegetables Pinto Bea...,$8.75

In [46]:
df['order_id'].duplicated().any()

True

In [48]:
df['order_id'].isnull().any()

False

In [51]:
df['item_name'] = df['item_name'].str.lower()

In [52]:
df['item_name'] = df['item_name'].str.strip()

In [54]:
df[['quantity', 'item_price']].describe()

          quantity
count  4563.000000
mean      1.076704
std       0.412739
min       1.000000
25%       1.000000
50%       1.000000
75%       1.000000
max      15.000000

In [56]:
df_encoded = pd.get_dummies(df, columns=['item_name'])

In [66]:
df[['quantity', 'item_price']]

      quantity item_price
0            1     $2.39
1            1     $3.39
2            1     $3.39
3            1     $2.39
4            2    $16.98
...        ...        ...
4617         1    $11.75
4618         1    $11.75
4619         1    $11.25
4620         1     $8.75
4621         1     $8.75

[4563 rows x 2 columns]

In [68]:
#Quantity of each item
item_quantity = df.groupby('item_name')['quantity'].sum()
print(item_quantity)

item_name
6 pack soft drink                         55
barbacoa bowl                             65
barbacoa burrito                          90
barbacoa crispy tacos                     12
barbacoa salad bowl                        9
barbacoa soft tacos                       25
bottled water                            204
bowl                                       4
burrito                                    6
canned soda                              124
canned soft drink                        340
carnitas bowl                             71
carnitas burrito                          60
carnitas crispy tacos                      8
carnitas salad                             1
carnitas salad bowl                        6
carnitas soft tacos                       40
chicken bowl                             752
chicken burrito                          584
chicken crispy tacos                      50
chicken salad                              9
chicken salad bowl                       123
chicken soft tacos                       116
chips                                    227
chips and fresh tomato salsa             130
chips and guacamole                      501
chips and mild fresh tomato salsa          1
chips and roasted chili corn salsa        23
chips and roasted chilicorn salsa         18
chips and tomatillo green chili salsa     45
chips and tomatillo red chili salsa       48
chips and tomatillogreen chili salsa      33
chips and tomatillored chili salsa        24
crispy tacos                               2
izze                                      19
nantucket nectar                          29
salad                                      2
side of chips                            110
steak bowl                               220
steak burrito                            383
steak crispy tacos                        36
steak salad                                4
steak salad bowl                          31
steak soft tacos                          56
veggie bowl                               87
veggie burrito                            97
veggie crispy tacos                        1
veggie salad                               6
veggie salad bowl                         18
veggie soft tacos                          8
Name: quantity, dtype: int64

In [69]:
#What was the most ordered item in the choice_description column?
most_ordered_choice = df['choice_description'].mode().iloc[0]
print(f"The most ordered item in the choice_description column: {most_ordered_choice}")

The most ordered item in the choice_description column: Diet Coke

In [71]:
#How many items were ordered in total?
total_items_ordered = df['quantity'].sum()
print(f"Total number of items ordered: {total_items_ordered}")

Total number of items ordered: 4913

In [83]:
df = df.drop('Total Price', axis=1)

In [85]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [87]:
df['item_price'] = df['item_price'].str.replace('[^\d.]', '', regex=True)

In [89]:
df['item_price'] = pd.to_numeric(df['item_price'])

In [90]:
df = df.dropna(subset=['item_price'])

In [102]:
df['item_price'] = df['item_price'].astype(int)

In [94]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price             int32
dtype: object

In [95]:
#How much was the revenue for the period in the dataset?
df['Total Price'] = df['quantity'] * df['item_price']
total_revenue = df['Total Price'].sum()
print(f"Total revenue for the period: ${total_revenue:.2f}")

Total revenue for the period: $36320.00

In [97]:
#How many orders were made in the period?
total_orders = df['order_id'].nunique()
print(f"Total number of orders made: {total_orders}")

Total number of orders made: 1834

In [98]:
#What is the average revenue amount per order?
average_revenue_per_order = total_revenue / total_orders
print(f"Average revenue per order: ${average_revenue_per_order:.2f}")

Average revenue per order: $19.80

In [101]:
#How many different items are sold?
unique_items_sold = df['item_name'].nunique()
print(f"Number of different items sold: {unique_items_sold}")

Number of different items sold: 50